/* BridgeConfViewController; first placeholder is bullet point (\u{2022}), second placeholder is bridge type "obfs4" */
"%1$@ %2$@ makes your traffic appear \"random\"." = "%1$@%2$@ធ្វើឱ្យ​ចរាចរណ៍​លេចឡើង \"ចៃដន្យ\"។";

/* BridgeConfViewController; first placeholder is bullet point (\u{2022}), second placeholder is bridge type "snowflake" */
"%1$@ %2$@ makes your traffic look like a phone call to a random user on the net." = "%1$@%2$@ធ្វើឱ្យ​ចរាចរណ៍​របស់​អ្នក​មើលទៅ​ដូចជា​ការហៅ​ទូរស័ព្ទ​ទៅ​កាន់​អ្នកប្រើ​ដោយ​ចៃដន្យ​នៅលើ​អ៉ីនធឺណិត។";

/* BridgesConfViewController */
"Automatic Configuration" = "Automatic Configuration";

/* BridgeConfViewController */
"Bridge Configuration" = "ការកំណត់ Bridge";

/* BridgeConfViewController; placeholder contains bridge type names: "meek-azure" or "obfs4" */
"Built-in %@" = "ដំឡើងស្រាប់ %@";

/* ScanQrViewController */
"Camera access was not granted or QR Code scanning is not supported by your device." = "ការចូលប្រើ​កាមេរ៉ា​មិនត្រូវបាន​ផ្ដល់​សិទ្ធិ ឬ​ការ​ស្គែន QR Code មិនត្រូវ​បាន​គាំទ្រ​ដោយ​ឧបករណ៍​របស់​អ្នក។";

/* AlertHelper */
"Cancel" = "បោះបង់";

/* MoatViewController */
"CAPTCHA Image" = "CAPTCHA Image";

/* CustomBridgesViewController */
"Copy URL to Clipboard" = "ចម្លង URL ទៅ Clipboard";

/* MoatViewController */
"Couldn't understand server response." = "មិនអាច​យល់​ការឆ្លើយតប​របស់​ម៉ាស៊ីនមេ។";

/* BridgeConfViewController */
"Custom Bridges" = "កំណត់ Bridges ខ្លួនឯង";

/* Transport */
"custom bridges" = "custom bridges";

/* CustomBridgesViewController */
"E-Mail" = "អ៉ីមែល";

/* MoatViewController */
"Enter characters from image" = "បញ្ចូល​អក្សរ​ពី​រូបភាព";

/* AlertHelper */
"Error" = "កំហុស";

/* BridgesConfViewController */
"I'm sure I cannot connect without a bridge." = "I'm sure I cannot connect without a bridge.";

/* BridgeConfViewController */
"If one type of bridge does not work, try using a different one." = "ប្រសិនបើ​ប្រភេទ bridge មួយ​មិន​ដំណើរការ សូម​ព្យាយាម​ប្រើ bridge ផ្សេងទៀត។";

/* BridgeConfViewController */
"If you are in a country or using a connection that censors Tor, you might need to use bridges." = "ប្រសិនបើ​អ្នក​នៅក្នុង​ប្រទេស​មួយ ឬ​កំពុង​ប្រើប្រាស់​ការ​តភ្ជាប់​មួយ​ដែលពិនិត្យ Tor នោះ​អ្នក​ប្រហែលជា​ត្រូវការ​ប្រើ bridges។";

/* CustomBridgesViewController; placeholder contains "https://bridges.torproject.org/", please visit that page and copy texts for your language! */
"In a separate browser, visit %@ and tap \"Get Bridges\" > \"Just Give Me Bridges!\"" = "នៅ​ក្នុង​កម្មវិធី​រុករក​ដាច់ដោយឡែក​មួយ ចូលមើល %@និង​ចុច \"ទទួលយក Bridges\" > \"សូម​ឱ្យ Bridges មក​ខ្ញុំ!\"";

/* BridgesConfViewController */
"Manual Configuration" = "Manual Configuration";

/* BridgeConfViewController */
"No Bridges" = "អត់មាន Bridges";

/* ApiError, placeholder is a non-success status from the server. */
"No success, but \"%@\" instead." = "មិន​ជោគជ័យទេ ប៉ុន្តែ \"%@\" ជំនួសវិញ។";

/* ApiError */
"No valid HTTP response." = "មិនមាន​ការឆ្លើយតប HTTP ត្រឹមត្រូវ​ទេ។";

/* Transport */
"Obfs4 bridges" = "Obfs4 bridges";

/* AlertHelper */
"OK" = "យល់ព្រម";

/* CustomBridgesViewController */
"Paste Bridges" = "បិទភ្ជាប់ Bridges";

/* CustomBridgesViewController; placeholder is "" "https://bridges.torproject.org/" */
"QR Code could not be decoded! Are you sure you scanned a QR code from %@?" = "QR Code មិនអាច​អាន​បំលែង​កូដ​បានទេ! តើ​អ្នក​ប្រាកដ​ថា​អ្នក​បាន​ស្គែន QR Code ពី %@?";

/* MoatViewController */
"Request Bridges" = "សំណើ Bridges";

/* BridgeConfViewController */
"Request Bridges from torproject.org" = "សំណើ Bridges ពី torproject.org";

/* ApiError */
"Request could not be formed. Please check host and username/password!" = "សំណើ​មិនអាច​បង្កើត​បានទេ។ សូម​ពិនិត្យ​ម៉ាស៊ីន និង​ឈ្មោះ​អ្នកប្រើ/ពាក្យសម្ងាត់!";

/* CustomBridgesViewController */
"Request via E-Mail" = "សំណើ​តាមរយៈ​អ៉ីមែល";

/* ApiError */
"Response body missing." = "ការឆ្លើយតប​បាត់​តួ";

/* CustomBridgesViewController, ScanQrViewController */
"Scan QR Code" = "ស្គែន​ QR Code";

/* Transport */
"Snowflake bridges" = "Snowflake bridges";

/* Transport */
"Snowflake bridges (AMP rendezvous)" = "Snowflake bridges (AMP rendezvous)";

/* MoatViewController */
"Solve the CAPTCHA to request bridges." = "ដោះស្រាយ CAPTCHA ដើម្បី​ស្នើសុំ Bridges។";

/* BridgesConfViewController */
"Try Auto-Configuration" = "Try Auto-Configuration";

/* CustomBridgesViewController */
"Upload QR Code" = "ផ្ទុកឡើង QR Code";

/* CustomBridgesViewController */
"Use Custom Bridges" = "ប្រើ Bridges ដែល​កំណត់​ខ្លួនឯង";

/* CustomBridgesViewController */
"Use QR Code" = "ប្រើ QR Code";
